app/Http/Controllers/MyController.php

select * from `products` limit 8 offset 0
select count(*) as aggregate from `products`
---
    public function shop(): View
    {
        return view('shop', ['products' => Product::paginate(8)]);

select * from `products` where `products`.`id` = '3' limit 1
---
    public function product($id): View
    {
        $product = Product::find($id);